{
	"@metadata": {
		"authors": [
			"Jayden Bailey"
		]
	},
	"migrateuseraccount": "Migrate user account",
	"migrateuseraccount-desc": "Allows users to reclaim their account on a wiki by verifying their identity on an external wiki.",
	"migrateuseraccount-loginprompt": "If you need to migrate your old account to this wiki, please follow the steps at [[Special:MigrateUserAccount]].",
	"migrateuseraccount-error-loggedin": "You are already logged in. If you need to migrate a different account, you should log out first.",
	"migrateuseraccount-error-user-invalid": "The user you entered does not exist or is already migrated.",
	"migrateuseraccount-help": "This page allows you to migrate your old account to this wiki, by verifying your identity on the old wiki. '''This will only take a minute''' and will allow you to reclaim your edit history and contributions.",
	"migrateuseraccount-form-password-help": "This is the password you'd like to use on this wiki.",
	"migrateuseraccount-token-title": "$1's token is: $2",
	"migrateuseraccount-token-help": "Please edit your user page on the previous wiki '''while logged in''', and paste this token into the content or edit summary. You can edit your user page on the previous wiki here: $1",
	"migrateuseraccount-token-button": "I've added the token",
	"migrateuseraccount-token-no-token": "We could not find the token. Please ensure it is in the content or edit summary of the most recent edit on $1.",
	"migrateuseraccount-token-no-recent-edit": "No edits have been made to $1 in the last 10 minutes. Please ensure you are editing the correct page.",
	"migrateuseraccount-token-username-no-match": "The last edit on $1 was made from the wrong account. Please ensure you are logged in to the correct account.",
	"migrateuseraccount-form-password": "New password",
	"migrateuseraccount-form-confirm-password": "Confirm new password",
	"migrateuseraccount-form-username": "Username",
	"migrateuseraccount-form-username-help": "This is the account you'd like to migrate from the old wiki.",
	"migrateuseraccount-form-newusername": "New username",
	"migrateuseraccount-form-newusername-help": "A user with the username '''$1''' already exists. Please enter a different username you would like to use on this wiki.",
	"migrateuseraccount-migrated-log-entry": "migrated their account",
	"migrateuseraccount-success": "Your account has been migrated. You can now [[Special:UserLogin|login]] with your username \"$1\" and your chosen password.",
	"migrateuseraccount-failed": "There was a problem migrating your account. Please try again later.",
	"migrateuseraccount-invalid-password": "The password you provided is not valid. Please ensure that it meets the requirements for this wiki.",
	"migrateuseraccount-wrong-confirm-password": "The passwords you entered do not match.",
	"migrateuseraccount-invalid-username": "The new username you entered is invalid or is in use."
}
