{
	"@metadata": {
		"authors": [
			"RU Minecraft Wiki editors"
		]
	},
	"migrateuseraccount": "Перенести учётную запись участника",
	"migrateuseraccount-desc": "Позволяет восстановить свою учетную запись на вики, подтвердив свою личность на внешней вики.",
	"migrateuseraccount-loginprompt": "Если вам нужно перенести свою старую учетную запись на эту вики, следуйте инструкциям на странице [[{{#special:MigrateUserAccount}}]].",
	"migrateuseraccount-error-loggedin": "Вы уже вошли в систему. Если вам нужно перенести другую учетную запись, сначала необходимо выйти из системы.",
	"migrateuseraccount-error-user-invalid": "Введенная вами учётная запись не существует или уже перенесена.",
	"migrateuseraccount-help": "Эта страница позволяет вам перенести свою старую учетную запись на эту вики, подтвердив свою личность в старой вики. '''Это займет всего минуту''' и позволит вам вернуть свою историю изменений и вклады.",
	"migrateuseraccount-form-password-help": "Это пароль, который вы хотели бы использовать на этой вики.",
	"migrateuseraccount-token-title": "Токен $1: $2",
	"migrateuseraccount-token-help": "Пожалуйста, отредактируйте свою страницу участника на предыдущей вики «войдя в систему» и вставьте этот токен в содержимое или отредактируйте описание. Вы можете редактировать свою страницу пользователя на предыдущей вики здесь: $1",
	"migrateuseraccount-token-button": "Я добавил токен",
	"migrateuseraccount-token-no-token": "Нам не удалось найти токен. Пожалуйста, убедитесь, что оно присутствует в содержимом или описании последних изменений на $1.",
	"migrateuseraccount-token-no-recent-edit": "За последние 10 минут в $1 не вносилось никаких изменений. Убедитесь, что вы редактируете правильную страницу.",
	"migrateuseraccount-token-username-no-match": "Последная правка в $1 была сделана не с той учетной записи. Пожалуйста, убедитесь, что вы вошли в правильную учетную запись.",
	"migrateuseraccount-form-password": "Новый пароль",
	"migrateuseraccount-form-confirm-password": "Подтвердите новый пароль",
	"migrateuseraccount-form-username": "Имя пользователя",
	"migrateuseraccount-form-username-help": "Это учетная запись, которую вы хотите перенести из старой вики.",
	"migrateuseraccount-form-newusername": "Новое имя пользователя",
	"migrateuseraccount-form-newusername-help": "Участник с именем '''$1''' уже существует. Пожалуйста, введите другое имя пользователя, которое вы хотели бы использовать в этой вики.",
	"migrateuseraccount-migrated-log-entry": "перенёс свою учётную запись",
	"migrateuseraccount-success": "Ваша учетная запись была перенесена. Теперь вы можете [[{{#special:UserLogin}}|войти]] с вашим именем пользователя «$1» и выбранным вами паролем.",
	"migrateuseraccount-failed": "Возникла проблема при переносе вашей учётной записи. Пожалуйста, повторите попытку позже.",
	"migrateuseraccount-invalid-password": "Введённый вами пароль некорректен. Пожалуйста, убедитесь, что он соответствует требованиям этой вики.",
	"migrateuseraccount-wrong-confirm-password": "Введенные пароли не совпадают.",
	"migrateuseraccount-invalid-username": "Введенное вами новое имя пользователя некорректен или уже используется."
}
