{
	"@metadata": {
		"authors": [
		  "Vil4ckc"
		]
	},
  	"migrateuseraccount": "Перенести свій акаунт",
  	"migrateuseraccount-desc": "Дозволяє користувачам відновити свій акаунт на вікі, підтвердивши свою особу на зовнішній вікі.",
  	"migrateuseraccount-loginprompt": "Якщо вам потрібно перенести свій старий акаунт до цієї вікі, будь ласка, дотримуйтесь інструкцій на сторінці [[Спеціальна:MigrateUserAccount]].",
	"migrateuseraccount-error-loggedin": "Ви вже увійшли в систему. Якщо вам потрібно перенести інший акаунт, спочатку вийдіть з системи.",
	"migrateuseraccount-error-user-invalid": "Користувач, якого ви ввели, не існує або вже переміщений.",
	"migrateuseraccount-help": "На цій сторінці ви можете перенести свій старий акаунт до цієї вікі, підтвердивши свою особу у старій вікі. '''Це займе лише хвилину''' і дозволить вам відновити історію редагувань та внески.",
	"migrateuseraccount-form-password-help": "Це пароль, який ви хочете використовувати на цій вікі.",
	"migrateuseraccount-token-title": "Токен $1'а(и) це: $2",
	"migrateuseraccount-token-help": "Будь ласка, відредагуйте вашу сторінку користувача на попередній вікі '''під час входу''' і вставте цей токен у вміст або анотацію до редагування. Ви можете відредагувати свою сторінку на попередній вікі тут: $1",
	"migrateuseraccount-token-button": "Я додав(ла) токен",
	"migrateuseraccount-token-no-token": "Ми не змогли знайти токен. Будь ласка, переконайтеся, що він є у вмісті або анотації останнього редагування на $1.",
	"migrateuseraccount-token-no-recent-edit": "За останні 10 хвилин до $1 не було внесено жодних змін. Будь ласка, переконайтеся, що ви редагуєте правильну сторінку.",
	"migrateuseraccount-token-username-no-match": "Останнє редагування на $1 було зроблено з неправильного акаунта. Будь ласка, переконайтеся, що ви увійшли в правильний акаунт.",
	"migrateuseraccount-form-password": "Новий пароль",
	"migrateuseraccount-form-confirm-password": "Підтвердіть новий пароль",
	"migrateuseraccount-form-username": "Ім'я користувача",
	"migrateuseraccount-form-username-help": "Цей акаунт ви хочете перенести зі старої вікі.",
	"migrateuseraccount-form-newusername": "Нове ім'я користувача",
	"migrateuseraccount-form-newusername-help": "Користувач з ім'ям '''$1''' вже існує. Будь ласка, введіть інше ім'я користувача, яке ви хочете використовувати у цій вікі.",
	"migrateuseraccount-migrated-log-entry": "Переніс вашого акаунта",
	"migrateuseraccount-success": "Ваш обліковий запис було перенесено. Тепер ви можете [[Спеціальна:Вхід|ввійти]] з вашим іменем користувача \"$1\" і вибраним паролем.",
	"migrateuseraccount-failed": "Виникла проблема з перенесенням акаунта. Будь ласка, повторіть спробу пізніше.",
	"migrateuseraccount-invalid-password": "Наданий вами пароль є недійсним. Будь ласка, переконайтеся, що він відповідає вимогам цієї вікі.",
	"migrateuseraccount-wrong-confirm-password": "Введені вами паролі не збігаються.",
	"migrateuseraccount-invalid-username": "Нове ім'я користувача, яке ви ввели, є недійсним або вже використовується."
}
